Revit 2027 API
PanelScheduleView.IsPanelScheduleTemplate Method
 Check if this is a panel schedule template.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPanelScheduleTemplate()
Public Function IsPanelScheduleTemplate As Boolean
public:
bool IsPanelScheduleTemplate()
member IsPanelScheduleTemplate : unit -> bool
Return Value
Boolean
 Check if this is a panel schedule template.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace